In [1]:
import pandas

In [2]:
import math

In [3]:
math.sqrt(3.14)

1.772004514666935

In [4]:
pandas.DataFrame([1234,2345,3456,4567])

      0
0  1234
1  2345
2  3456
3  4567

In [5]:
import pandas as pd

In [6]:
pd.DataFrame([1234,2345,3456,4567])

      0
0  1234
1  2345
2  3456
3  4567

In [7]:
from pandas import DataFrame

In [8]:
DataFrame([1234,2345,3456,4567])

      0
0  1234
1  2345
2  3456
3  4567

In [9]:
from pandas import DataFrame as DF

In [10]:
DF([1234,2345,3456,4567])

      0
0  1234
1  2345
2  3456
3  4567

In [11]:
df = pd.DataFrame([
    ['Kim', 22, '010-0000-1234', 'M'],
    ['Na', 26, '010-0000-5678', 'M'],
    ['Park', 23, '010-1234-1234', 'F'],
    ['Lee', 24, '010-5678-5678', 'F']
], columns=['Name', 'Age', 'Phone', 'Gender'])

In [12]:
df

   Name  Age          Phone Gender
0   Kim   22  010-0000-1234      M
1    Na   26  010-0000-5678      M
2  Park   23  010-1234-1234      F
3   Lee   24  010-5678-5678      F

In [13]:
df.shape

(4, 4)

In [14]:
df.columns

Index(['Name', 'Age', 'Phone', 'Gender'], dtype='object')

In [15]:
len(df.columns)

4

In [16]:
df.columns[0]

'Name'

In [17]:
# loc[] -> 라벨(index) 기반
df.loc[0]

Name                Kim
Age                  22
Phone     010-0000-1234
Gender                M
Name: 0, dtype: object

In [18]:
#iloc[] -> 실제 위치 기반
df.iloc[0]

Name                Kim
Age                  22
Phone     010-0000-1234
Gender                M
Name: 0, dtype: object

In [19]:
df.iloc[0]['Age']

np.int64(22)

In [20]:
df['Age']

0    22
1    26
2    23
3    24
Name: Age, dtype: int64

In [21]:
df['Age'].sum() # Age 컬럼의 합계

np.int64(95)

In [22]:
df['Age'].mean() # Age 컬럼의 평균

np.float64(23.75)

In [23]:
df['Age'].median() # Age 컬럼의 중앙값

23.5

In [24]:
df['Age'].var() # Age 컬럼의 분산

2.9166666666666665

In [25]:
df['Age'].std() # Age 컬럼의 표준편차

1.707825127659933

In [26]:
df['Age'].max() # Age 컬럼의 최대값

26

In [27]:
df['Age'].min() # Age 컬럼의 최소값

22

In [28]:
df

   Name  Age          Phone Gender
0   Kim   22  010-0000-1234      M
1    Na   26  010-0000-5678      M
2  Park   23  010-1234-1234      F
3   Lee   24  010-5678-5678      F

In [29]:
df['Gender'].value_counts() # Gender 컬럼의 빈도수

Gender
M    2
F    2
Name: count, dtype: int64

In [30]:
df[df['Gender'] == 'M']

  Name  Age          Phone Gender
0  Kim   22  010-0000-1234      M
1   Na   26  010-0000-5678      M

In [31]:
df[df['Gender'] == 'F']

   Name  Age          Phone Gender
2  Park   23  010-1234-1234      F
3   Lee   24  010-5678-5678      F

In [32]:
df[df['Gender'] == 'M']['Age'].mean()

np.float64(24.0)

In [33]:
for g in ['M', 'F'] :
    print (g, df[df['Gender'] == g]['Age'].mean())

M 24.0
F 23.5

In [34]:
df['Gender'].unique()

array(['M', 'F'], dtype=object)

In [35]:
for g in df['Gender'].unique() :
    print (g, df[df['Gender'] == g]['Age'].mean())

M 24.0
F 23.5

In [36]:
list(df.groupby('Gender'))

[('F',
     Name  Age          Phone Gender
  2  Park   23  010-1234-1234      F
  3   Lee   24  010-5678-5678      F),
 ('M',
    Name  Age          Phone Gender
  0  Kim   22  010-0000-1234      M
  1   Na   26  010-0000-5678      M)]

In [37]:
GAmean = df.groupby('Gender')['Age'].mean()

In [38]:
type(GAmean)

pandas.core.series.Series

In [46]:
pd.DataFrame(['Kim','Na','Park','Lee'], columns=['Last Name'], index=['1','2','3','4',])

  Last Name
1       Kim
2        Na
3      Park
4       Lee